---
type: ScheduleHeightsOnSheet
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ScheduleHeightsOnSheet

`Autodesk.Revit.DB.ScheduleHeightsOnSheet` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBodyRowHeights | 2022.1 | `public IList < double > GetBodyRowHeights ()` |
| Property | ColumnHeaderHeight | 2022.1 | `public double ColumnHeaderHeight { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | TitleHeight | 2022.1 | `public double TitleHeight { get ; }` |